БухЭксп/InformationRegisters/АбонентыЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АбонентыЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодробноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействияСертификатов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОператорЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПользователь1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеТребуетПриглашений</Name>
					<Comment>Признак того, что абонент готов принимать документы без предварительного приглашения.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодыТиповДокументовКОбмену</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/ОператорыЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОператорыЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбменаЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтпечатокСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступноПодключениеЧерез1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаСтраницуТехническойПоддержки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьШаблонСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасширениеФайлаСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействияСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДоступноПодключениеБезОГРН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОднородныйОтветНаВсеДокументыПакета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриРегистрацииПредставителяТребуетсяМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддерживаемыеПриРегистрацииПредставителяТипыМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеподдерживаемыеФорматы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеКоличествоЭДВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйРазмерПакетаЭД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОшибкиНедействительныхСертификатов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПоддерживаемогоРегистрационногоПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддерживаетсяОбменБезПриглашений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/АбонентыЭДО/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановленныеСвязи = Новый Массив;
	ОжидающиеСвязи = Новый Массив;
	ИдентификаторОператораЭДО = "";
	СтатусПринято = 3;
	СтатусОжидаемСогласия = 2;
	
	Если ЗначениеЗаполнено(Параметры.ИдентификаторыКонтрагента) Тогда
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокАбонентов, "ИдентификаторЭДО",
			Параметры.ИдентификаторыКонтрагента,,, Истина);

		Если ЗначениеЗаполнено(Параметры.Контрагент) И ЗначениеЗаполнено(Параметры.ИдентификаторОрганизации) Тогда
	
			ПараметрыПолучения = РаботаСАбонентамиЭДО.НовыеПараметрыПолученияСвязиИдентификаторов();
			ЗаполнитьЗначенияСвойств(ПараметрыПолучения, Параметры, "Контрагент");
			ПараметрыПолучения.ИдентификаторыОрганизации = Параметры.ИдентификаторОрганизации;
			ПараметрыПолучения.ИдентификаторыКонтрагента =  Параметры.ИдентификаторыКонтрагента.ВыгрузитьЗначения();
			ПараметрыПолучения.ФормироватьСписокВыбора = Ложь;
	
			ПараметрыСвязи = РаботаСАбонентамиЭДОСлужебный.ПараметрыСвязиИдентификаторов(ПараметрыПолучения);
			
			Для Каждого ПараметрСвязи Из ПараметрыСвязи Цикл
				
				Если ПараметрСвязи.СтатусПодключения = СтатусПринято Тогда
					УстановленныеСвязи.Добавить(ПараметрСвязи.ИдентификаторКонтрагента);
				ИначеЕсли ПараметрСвязи.СтатусПодключения = СтатусОжидаемСогласия Тогда
					ОжидающиеСвязи.Добавить(ПараметрСвязи.ИдентификаторКонтрагента);
				Иначе
					Продолжить;
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЕсли;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ИдентификаторОрганизации) Тогда
		ИдентификаторОператораЭДО = 
			УчетныеЗаписиЭДОКлиентСервер.ИдентификаторОператора(Параметры.ИдентификаторОрганизации);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокАбонентов, "МассивУстановленных", 
		УстановленныеСвязи);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокАбонентов, "МассивОжидающих", 
		ОжидающиеСвязи);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокАбонентов, "Требуются", 
		НСтр("ru='Требуются'"));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокАбонентов, "НеТребуются", 
		НСтр("ru='Не требуются'"));
	
	ОператорПоддерживаетНастройкуТребованияПриглашений =
		СервисНастроекЭДОПовтИсп.ОператорПоддерживаетВерсиюФорматаРегистрации(ИдентификаторОператораЭДО, "5.04");
		
	Элементы.СписокАбонентовПриглашения.Видимость = ОператорПоддерживаетНастройкуТребованияПриглашений;
	Элементы.СписокАбонентовТипыДокументов.Видимость = ОператорПоддерживаетНастройкуТребованияПриглашений;
	
	ОбщегоНазначенияБЭД.СброситьРазмерыИПоложениеОкна(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокАбонентов

&НаСервереБезКонтекста
Процедура СписокАбонентовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// Получим описание кодов типов документов
	МассивНаименований = Новый Массив;
	ТаблицаТиповДокументов = РегистрыСведений.ОператорыЭДО.КодыПоддерживаемыхТиповДокументов();
	
	Для Каждого СтрокаСписка Из Строки Цикл
		
		СтрокаКодов = СтрокаСписка.Значение.Данные.КодыТиповДокументовКОбмену;
		
		Если Не ЗначениеЗаполнено(СтрокаКодов) Тогда
			СтрокаСписка.Значение.Данные.КодыТиповДокументовКОбмену = НСтр("ru = 'Все'");
			Продолжить;
		КонецЕсли;
		
		МассивНаименований.Очистить();
		
		// Прочитаем коды типов документов, которые поддерживает контрагент
		КодыТипов = ОбщегоНазначения.JSONВЗначение(СтрокаКодов);
		
		// Переведем коды типов документов в их названия, для вывода пользователю
		Для Каждого КодТипа Из КодыТипов Цикл
			
			НайденнаяСтрока = ТаблицаТиповДокументов.Найти(КодТипа, "Код");
			Если НайденнаяСтрока <> Неопределено Тогда
				МассивНаименований.Добавить(НайденнаяСтрока.Наименование);
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокаСписка.Значение.Данные.ТипыДокументов = СтрСоединить(МассивНаименований, ", ");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАбонентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПередатьВыбранноеЗначение();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ПередатьВыбранноеЗначение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередатьВыбранноеЗначение()
	
	ТекущиеДанные = Элементы.СписокАбонентов.ТекущиеДанные;
	Идентификатор = ?(ТекущиеДанные = Неопределено, "", ТекущиеДанные.ИдентификаторЭДО);
	
	Закрыть(Идентификатор);
	
КонецПроцедуры

#КонецОбласти
